Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.ModifyBendSurface Method
 Modifies the shape of a bend surface section, and updates related polygon sections accordingly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry ModifyBendSurface(
	ConnectiveGeometry geometry,
	GeometrySection bendSection,
	BendSurface surface
)
Public Function ModifyBendSurface (
	geometry As ConnectiveGeometry,
	bendSection As GeometrySection,
	surface As BendSurface
) As ConnectiveGeometry
Parameters
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Reference geometry to modify which contains cylindricalSection.
bendSection
Type: Tekla.Structures.Model.GeometrySection
Geometry section to modify.
surface
Type: Tekla.Structures.Model.BendSurface
The modified bend surface for the section.
Return Value
Type: ConnectiveGeometry
Modified ConnectiveGeometry if command succeeded or geometry otherwise.
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not modify the bend surface.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace